#!/usr/bin/env bash
#
# vim:ts=4:sw=4:et:ai:sts=4:filetype=sh
# $(basename 0).sh - Descrição do programa
#
# Autor:     Gustavo Sousa
# Manutenção:
#
# ---------------------------------------------------------------------------- #
#  Este programa irá informar se o número é Negativo, Positivo ou Nulo
#
#  Exemplos:
#      $ ./numero_inteiro.sh
#      Neste exemplo o script será executado ...
# ---------------------------------------------------------------------------- #

# ---------------------------------------------------------------------------- #

# --------------------------------- VARIÁVEIS -------------------------------- #

# ---------------------------------------------------------------------------- #

# ---------------------------------- TESTES ---------------------------------- #

# ---------------------------------------------------------------------------- #

# --------------------------------- FUNÇÕES ---------------------------------- #
Nulo () {
  if [ $numero -eq 0 ]
  then
    echo "Número Nulo!"
    exit 0
  fi
}
Positivo_Negativo () {
  if [ $numero -gt 0 ]
  then
    echo "$numero é Positivo!"
    exit 0
  else
    echo "$numero é Negativo"
  fi
}
# ---------------------------------------------------------------------------- #

# --------------------------------- EXECUÇÃO --------------------------------- #
#clear
echo
read -p "Informe um número: " numero
Nulo
Positivo_Negativo
# ---------------------------------------------------------------------------- #
